import React from 'react'
import one from "./img/1.jpg"
import one2 from "./img/2.jpg"
import one3 from "./img/3.jpg"
import one4 from "./img/4.jpg"
import one5 from "./img/5.jpg"
import one6 from "./img/6.jpg"
import one7 from "./img/7.jpg"
function Switch() {
    return (
        <div>
            <h1>Switch Կոնստրուկցիան</h1>
            <p>
                Switch Կոնստրուկցիան փոխարինում է միսանգամից մի քանի if
            </p>
            <p>
                Այն ներկայացնում է արտահայտությունը միանգամից մի քանի տարբերակների հետ համեմատելու ավելի տեսողական միջոց
            </p>
            <p>
                Switch Կոնստրուկցիան ունի մեկ կամ մի քանի բլոկ case և ոչ պարտադրի բլօկ default
            </p>
            <img src={one} />
            <ul>
                <li>
                    փոփախական x ստուգվում է խիստ ռեժիմում առաջին արժեքի հետ value1, հետո երկրորդի value2 և այսպես շշարունակ
                </li>
                <li>
                    Եթե ​​համապատասխանություն հաստատվի  switch սկսում է կատարել համապատասխան case հրահանգից և հետո կլինի մոտակա break
                </li>
                <li>
                    Եթե ոչ մի case չհամապատասխանի կկատարվի default ը
                </li>
            </ul>
            <h3>աշխատանքի օրինակ </h3>
            <p>switch աշխատանքը կատարվող բլօկը ընդգծված է </p>
            <img src={one2} />
            <p>
                Ասյտեղ switch օպերատորը հերդականությամբ համեմատում է a բոլոր case երի հետ
                Առաջինը case 3 է ստուգվում և քանի որ մանություն չի գտնվել Անցնում է 4 ին Նմանությունը գտնվել է և սկսվում է կատարվել այդ case
                որում կա alert( 'В точку!' ) և հետո կկատարվի մոտակա break ը որը կնդատի մնացած ստուգումն երը
            </p>
            <p>
                Եթե break ը բացակայեր ուրեմն կոդը կշարունակեր կատարվել անցնելով հաջորդ case ին Այդ պարագայում մնացած բոլոր ստուգումն երը կչեղարկվ էին
                Օրինակը առանց break:
            </p>
            <img src={one3} />
            <p>
                վերևում գրված կոդ ցույց կտա 3 alert
            </p>
            <img src={one4} />
            <h3>
                Ցանկացած արտահայտությունը կարող է հանդես գալ որպես արգումենտ switch/case համար
            </h3>
            <p>
                Եվ switch և case թույլեն տալիս ցանկացած արտահայտությունը ընդունել որպես արգումենտ
                Օրինակ
            </p>
            <img src={one5} />
            <p>
                այս օրինակում +a տողային 1 սարքում է թվային 1 որնել համապատասխանում է b + 1 case ին
                և նրանում գտնվող կոդը կսկվի կատարվել
            </p>
            <h3>
                «case» երի խմբավորում
            </h3>
            <p>
                մի քանի «case» երը օգտագործում են նույն կոդը մենք կարողենք նրանց խմբավորել
                օրնակ ներքևում case 3 և case 5 կատարում են նույն գործողությունը որը մենք խմավորել ենք
            </p>
            <img src={one6} />
            <p>
                Հիմա թե 3 և 5 ցույց կտան նույն նամակը
            </p>
            <p>
                case խմբավորումը համարվում է side efect նրա համար որ switch/case աշխատում է առանց break ի
                այստեղ case 3 որը սսկվում է (*) այս տողից և շարունակվում է case 5 քանի որ բացակայում է break ը
            </p>
            <h3>Տիպերը ունեն կարևորություն </h3>
            <p>
                պետք է նշել որ ստուգում ը միշտ կատարվում է խիստ ռեժիմում այսինքն արժեքները միշտ պետքե լինեն նույնտիպի
            </p>
            <img src={one7} />
            <p>
            '0' և '1' համար կկատարվի առաջին alert 
            '2' համար երկրորդ alert 
            բայց 3 ի համար prompt ը կլինի "3" տողային տիպ որը չի համապատասխանում խիստ ռեժիմին === 3 տվի հետ 
            նման պարագայում մենք ուննենք մեռած կոդ case 3 ում և կկատարվի default բլօկը
            </p>
        </div>
    )
}

export default Switch