import React from 'react'
import one from "./img/1.jpg"
import two from "./img/2.jpg"
import three from "./img/3.jpg"
import fore from "./img/4.jpg"
import fife from "./img/5.jpg"
function InteractionAlert() {
  return (
    <div>
        <h1>գործողություներ : alert, prompt, confirm</h1>
        <p>
            քանի որ մենք օգտագործում ենք բրաուզերը եկենք ծանոթանանք մի քանի ֆունկցիայի
            որը տրամադրում է մեզ բրաուզերի ինտերֆեյսը
        </p>
        <h3>alert</h3>
        <p>
            այս ֆունկցիային մենք արդեն ծանոթենք այն ցույց է տալիս նամակ
            և սպասում մինչեւ օգտագործողը սղմի «ОК»
        </p>
        <img src={one} />
        <p>
            դա փոփր պատուհանն է նամակով որը կչվում է մօդալ պատուհան 
            մօդալ հասկացողությունը նա է երբ օգտագործողը չի կարող օգտվել բրաուզերի այլ հատվածներից քանի դեռ մօդալ պատուհանը բաց է 
            այս օրինակում քանի դեռ ОК կնոպկան չի սղմվել
        </p>
        <h3>prompt</h3>
        <p>
            ֆունկցիա prompt ընդունում է 2 արգումենտ 
        </p>
        <img src={two} />
        <p>
            այս կոդը ցույց է տալիս մօդալ պատուհան տեքստով 
            ինպուտով և կնոպկաներով OK/Отмена.
        </p>
        <p>
            title տեքստը որը հայտնվում է մօդալում 
            default պարտադիր պարամետր չե բայց այն իր մեջ պահպանում է ինփութի նախնական արժեքը 
            [...] որը գրված է վերվում ուղակի նշանակում է որ այն ոչ պարտադիր պարամետր է
        </p>
        <p>
            օգտագործողը կարողե ինչ որ բան գրել ինփութում և սեղմել օկ 
            Մուտքագրված տեքստը կհանձնվի result փոփխականին օգտագործողը նաև կարող է
            սղմի «Отмена» կնոպկեն կամ կլավյատուրայի Esc այդ պարագայում result արժեքը կդարնա null

        </p>
        <p>
        prompt i կանչը վեադարձնում տեքստ որը նշված է մուտքագրման դաշտում կամ null եթե օգտագործողը սղմի ատմենա կոճակը 
        </p>
        <img src={three} />
        <h3>confirm</h3>
        <p>
            գրելաձևը
        </p>
        <img src={fore} />
        <p>
        confirm ֆունկցիան ցույց է տալիս մօդալ պատուհան տեքստային հարցով և երկու կնոպկաներով 
        OK և Отмена արդյունքը true է երբ սեղմվում է OK իսկ հակառակ դեպքում false
        օրինակ
        </p>
        <img src={fife} />
    </div>
  )
}

export default InteractionAlert