import React from 'react'
import one from "./img/1.jpg"
import two from "./img/2.jpg"
import three from "./img/3.jpg"
import fore from "./img/4.jpg"
import fife from "./img/5.jpg"
import sex from "./img/6.jpg"
import seven from "./img/7.jpg"
import ene from "./img/8.jpg"
import nane from "./img/9.jpg"
import one1 from "./img/10.jpg"
function OperatorIf() {
  return (
    <div>
        <h1>Պայմանական ճյուղավորում : If : ?</h1>
        <p>
            երբեմն մենք պետքե կատարենք գործողություներ որոշ պայամներից ելնելով 
        </p>
        <p>
            Դրա համար մենք օգտագործում ենք if գործողությունը և պայմանի օպերատորը  ? 
            որը կոչվում է նաև "հարցական նշան"օպերատոր:
        </p>
        <h3>
            if օպերատորը
        </h3>
        <p>
        if օպերատորը հաշվարկում է պայմանը փակագծերում և եթե այն true է ապա այն կկատարի բլոկի ներսի կոդը 
        </p>
        <p>
            Օրինակ
        </p>
        <img src={one} />
        <p>
            Վերոնշյալ օրինակում պայմանը պարզե այն համեմատում է (year == 2015) բայց պայմաները կարողեն լիել նաև բարդ 
        </p>
        <p>
            Եթեմենք ցանկանում ենք կատարել մի քանի գործողություն այդ դեպքում գործողությունները կգրենք ձևավոր փակագծերի մեջ 
        </p>
        <img src={two} />
        <p>
            աշխատեք միշտ օգտագործել ձևավոր փակագծերը եթե նույնիսկ if ը իրենից ներկայացնում է պարզ արտահայտություն 
        </p>
        <h3>Փոխակերպում լօգիկական տիպի </h3>
        <p>
            if() գործողություն հաշվարկում է արտահայտությունը փակագծերում և արդյունքը վերածում տրամաբանական տիպի
        </p>
        <p>
            եկեք հիշենք կանոնը տիպերի փոխակերպման դասիից 
        </p>
        <ul>
            <li> թիվ 0  դատարկ տողը "" null undefined և  NaN դառնում են false այդ պատճառով նրանց անվանում են սուտ  («falsy»)  արժեք </li>
            <li>Իսկ մնացած արժեքները դառնում են true այդ իսկ պատճառով նրանց անվանում են իրական («truthy»).</li>
        </ul>
        <p>
            Այդ իսկ պատճառով հաջորդ նկարի կոդը երբեք տեղի չի ունենա 
        </p>
        <img src={three} />
        <p>
            իսկ այս պարագայում այն կիրականանա միշտ 
        </p>
        <img src={fore} />
        <h3>«else» Բլոկը</h3>
        <p>
        if Գործողությունը կարող է նաև պարունակել ոչ պարտադիր բլօկ else (Հակառակ դեպքում ) որը կկատարվի այն դեպքում երբ պայմանը flase 
        </p>
        <img src={fife} />
        <h3>«else if» Մի քանի պայամներ </h3>
        <p>
            երբեմն մեզ պետք ե կատարել մի քանի պայմանի ստուգում դրա համար մենք օգտագործում ենք else if բլոկը 
        </p>
        <img src={sex} />
        <p>
            Վերնշված կոդում avaScript առաջին ստուգում է year փոքր է 2015 եթե այն սխալ ե անցնում է հաջորդին year մեծ է 2015
            եթե այս պայմանը նունպես սխալ է կատարվում else բլօկը 
        </p>
        <h3>
            Պայմանական օպերատոր  „?“
        </h3>
        <p>երբեմն մեզ պեքտ է հայտարարաել փոփոխականը կախված պայմանից</p>
        <img src={seven} />
        <p>հարցական նշանը որը նույնպես համարվում է պայմանի օպերատոր նա մեզ թույլ է տալիս այս պայմանը օգտագործել ավելի կարճ գրելաձևով</p>
        <p>? նշանը նաև անվանվում է ternary օպեատոր</p>
        <p>ternary օպերատորը ունի 3 արգում ենտ </p>
        <p>Գրելաձև</p>
        <img src={ene} />
        <p>
            1 ինը ստուգվում է պայմանը եթե այն ճիշտ է ապա վերադարձնվում է значение1 Հակառակ դեպքում значение2
        </p>
        <img src={nane} />
        <p>
            այստեղ մենք կարողենք նույնիսկ չգրել փակագծերը քանի որ ? նշանը ունի ցածր առաջնահերդություն
            այսինքն այն կկատարվի համեմատումից հետո 
            բայց փակագծերը կոդը դարձնում են հեշտ ընդերնելի 
        </p>
        <h3>մի քանի օպերատոր „?“</h3>
        <p>
        ternary օպեատոր կարողե նաև վերադարձնել արժեք մի քանի պայմանից կախված
        </p>
        <img src={one1} />
        <ul>
            <li>առաջին հարցական նշանը ստուգում է age մեծ է 3 ից </li>
            <li>Եթե պայմանը ճշմարիտ է վերադարձնվում է Здравствуй, малыш!' հակառակ դեպքում ստուգվում է պայմանը որը գրված է „:“ այս օպերատորից հետո age մեծ է 18ից</li>
            <li> Եթե պայմանը ճշմարիտ է վերադարձնվում 'Привет!'  հակառակ դեպքում ստուգվում է պայմանը որը գրված է „:“ այս օպերատորից հետո համեմատում է age մեծ է 100ից  </li>
            <li>Եթե պայմանը ճշմարիտ է վերադարձնվում 'Здравствуйте!' հակառակ դեպքում վերադարձնվում վերջին վերջակետից հետո գրված տեքստը Какой необычный возраст!'</li>
        </ul>
        <p>
            Բայց օգտագործեք շատ պայմաներ ստուգոլու դեպքում if else բլօկը քանի որ այն ավելի հեշտե կարդացվում 
        </p>
    </div>
  )
}

export default OperatorIf