import React from 'react'
import one1 from "./img/1.jpg"
import one2 from "./img/2.jpg"
import one3 from "./img/3.jpg"
import one4 from "./img/4.jpg"
import one5 from "./img/5.jpg"
import one6 from "./img/6.jpg"
import one7 from "./img/7.jpg"
import one8 from "./img/8.jpg"
function ArrowFunctionBasic() {
  return (
    <div>
        <h1>Սլաք ֆունկցիաների հիմունքները</h1>
        <p>
            Գոյություն ունի ևվս մեկ շատ հասարակ գրելաձև ֆունկցիա ստեղծելու համար,
            որը շատ ժամանակ ավելի հարմար է օգտագործ էլ քան Function Expression.
        </p>
        <p>
            Այն կոչվում է սլաք ֆունկցիա  (arrow functions), որի սինտաքսը հետևյալն է 
        </p>
        <img src={one1} />
        <p>
            այս կոդում ստեղծվում է ֆունկցիա func անուննով, որը ընդոնում է արգումենտներ arg1..argN , հետո հաշվարկում է expression ը աջ կողմում և վերադարձնում է արժեքը 
            այլ կերպ ասած դա function exporesion ի կրճատ գրելաձևն է 
        </p>
        <img src={one2} />
        <p>
            եկեք տեսնենք կոնկրետ օրինակ 
        </p>
        <img src={one3} />
        <p>
            ինչպես կարողենք տեսնել <img src={one4} /> կոդը ստեղծում է ֆունկցիա որը ընդունում է երկու արգումենտ a և b և կանչվելու ժամանակ այն հաշվարկում է արտահայտությունը a + b և վերադարձնում է արժեքը 
        </p>
        <li>
            եթե մենք ունենք մի արագումենտ ապա փակակգծերը որը դրվում է պարամետրները հայտարարելու ժամանակ կարելի է այն այնտեսել և ունենալ ավելի կարճ գրելաձև 
        </li>
        <img src={one5} />
        <li>
            Եթե արգումենտներ չկան կլոր փակակգծերը կլինենն դատարկ բայց այս պարագայում նրանք պարտադիր են
        </li>
        <img src={one6} />
        <p>
            arrow function երը կարողենք ստեղծել նաև որպես Function Expression.
            Օրինակ դինամիկ ձևով ֆունկցիա հայտարարելու համամր 
        </p>
        <img src={one7} />
        <h3>Մի քանի տողանի arrow function</h3>
        <p>
            Սլաք ֆունկցիաները որը տեսանք մինչ այս եղելե էին շատ հասարակ Նրանք վերցնում էին արգումենտները 
            սլաքի ձախ կողմից {"=>"} և վերադարձնում էին արդունքը վերագրելով աջ կողմում 
        </p>
        <p>
            երբեմն մեզ անրաժեշտ է ավելի բարդ ֆունկցիա կազմված մի քանի արտահայտությունից և հրահանգներից Դա նույնպես հնարավոր է Սլաք ֆունկցիաներում բայց այդ դեպքում պետք է ֆունկցիայի մարմինը տեղադրենք ձևավոր փակագծերի մեջ ինչպես նաև արդեն պեքտ է օգտագործենք return հրամանը արժեք վերադարձնելու դեպքում ինչպես սովորական ֆունկցիաներում 
            օրինակը ներքևում
        </p>
        <img src={one8} />
        <h3>հետագայում ավելի շատ </h3>
        <p>
           այստեղ մենք ներկայացրեցինք գլխավոր գաղափարը Սլաք ֆունկցիաների բայց սա դեռ ամենը չէ 
           Սլաք ֆունկցիաները  տիրապետում են մի շարք այլ հնարավորություների բայց դրանց կանրադառնանք հետագայում
        </p>
    </div>
  )
}

export default ArrowFunctionBasic