import React from 'react'

function UseStrict() {
  return (
    <div>
        <h1>Խիստ ռեժիմ - "use strict" </h1>
        <p>
        Երկար ժամանակ JavaScript-ը զարգանում էր առանց որև է համատեղելիության խնդիրների:
        Նոր ֆունկցիոնալ էո ավելանում լեզվին, այն ժամանակ երբ հին ֆունկցիալնալը մնում էր նույնը
        Առավելությունը նման մոտեցման նաեր որ ստեղծված կոդը շարունակում էր աշխատել 
        Թերություն նա էր որ ցանկաղած խնդիր կամ անկատար լուծում ընդունված JavaScript-ի ստեղծողների կողմից,
        մնաց լեզվում ընդմիշտ 
        </p>
        <p>
            Այդպես շարունակվեց մինչև 2009 թվականը, երբ թողարկվեց  ECMAScript 5 (ES5)
            այն ավելացրեց նոր հնարավորություններ լեզվին և փոխեց մի քանի բան 
            Որպիսզի հին կոդը աշխատի այնպես ինչպես նախկինում default այս փոփոխությունները չեն արվում 
            Դրա համար մենք պետքա ակտիվացնենք այն "use strict" հատուկ հրահանգի օգնությանմբ
        </p>
        <h3>«use strict»</h3>
        <p>
        Հրահանգի տեսքը նման է տողի "use strict" կամ 'use strict' ։ երբ այս հրահանգը գտնվում է Script-ի
        վերևում ողջ կոդը աշխատում է ժամանակաից ռեժիմում 
        </p>
        <p>
        "use strict" կարողենք դնել նաև որոշ ֆունցիաների սկզբում սա թույլ է տալիս «use strict» միացնել միայն կոնկրետ այդ ֆունկցիաներում
        </p>
        <h3>Բրաուզերի վահանակ (Консоль браузера)</h3>
        <p>
        Բրաուզերի վահանակում use strict default անջատվծ է
        քանի որ որոշ դեպքերում մենք կարողենք ստանալ սխալ պատասխան
        և այսպես ինչպես միացնել այն բրաուզերում 
        կարելի է օգտագործել Shift+Enter մի  քանի տողեր մուտքագրելու համար և նրանց վերևում գրել use strict

        </p>
        <h3>Միշտ է հարկավոր օգտագործ էլ use strict ?</h3>
        <p>
        Ժամանակակից JavaScript ունի Կլասսներ և Մոդուլներ որոնք ավտոմատ միացնում են Խիստ ռեժիմը
        բայց խորհուրդ է տրվում այն միացնել ֆայլի վերևում
        </p>
    </div>
  )
}

export default UseStrict