import React from 'react'

function Introduction() {
  return (
    <div>
        <h1>JS Ներածություն</h1>
        <h3>Ինչ է JS-ը</h3>
        <p>
        Ի սկզբանե JS-ը ստեղծվել է որպիսզի web կայքերին տա կյանք։
        </p>
        <p>Այս լեզվով գրված ծրագրերը կոչվում են script-ն էր։ Նրանք կարող են տեղավորվ էլ 
        HTML-ում և ավտոմատ կերպով աշխատեն web էջի բացման ընդացքում :
        </p>
        <p>
        Script-ն էր տարածվում են և աշխատում են, ինչպես սովորական տեքստ նրանց պետք չէ հատուկ պատրաստում կամ
        կամպիլացիա աշխատանքի համար
        </p>
        <p>
            Սա առանձնացնում է  JavaScript-ն ուրիշ լեզուներից օրինակ Javia-ից
        </p>
        <h3>Ինչու JavaScript</h3>
        <p>
            Երբ JavaScript-ը ստողծվում էր նա ուներ ուրիշ անուն LiveScript։ Բայց այդ ժամանակ
            Javia-ն շատ հայտնի եր և որոշվեց անունը լինի JavaScript որպես  Javia-ի 
            փոքր եղբայր։
            Ժամանկի ընդացքում JavaScript դարձավ լրիվ առանձին իր սեփական ճշգրտման շնորհիվ  ECMAScript, 
            և հիմա ոչմի կապ չունի Javia-ի հետ
        </p>
        <p>
            Այսօր արդեն JavaScript-ը կարող է աշխատել ոչ միայն Բրաուզերում այլ նաև Սերվերում
            և ամենուր եք որտեղ կա հատուկ ծրագիր որը կոչվում է JavaScript-ի շարժիչ (движок)
        </p>
        <p>
            Բրաուզերում կա հատուկ շարժիչ որը հաճախ անվանում են  «виртуальная машина JavaScript» (BrowserEngine)
        </p>
        <p>
            տարբեր բրաուզերների մոտ դա տարբեր անվանում է 
            <ul>
                <li>V8 – в Chrome, Opera и Edge.</li>
                <li>SpiderMonkey – в Firefox.</li>
                <li> «Chakra» для IE, «JavaScriptCore», «Nitro» и «SquirrelFish» для Safari и т.д.</li>
            </ul>
        </p>
        <h3>Ինչպես են աշխատում շարժիչները ?</h3>
        <p>
        շարժիչները բարդ են , բայց ընդհանուր գաղափարը հասկանալը հեշտ 
        1․ շարժիչը ներկառուցված է եթե դա Բռաուզերն է, այն կարդում է(«парсит») script-ի տեքստը
        2․ հետո այն փոխակերպում է («компилирует») script-ը մեքենայական լեզվի
        3․ դրանից հետո մեքենայական կոդը մինաում է և աշխատում է շատ արագ
        </p>
        <h3>Ինչ կարող է անել Բրաուզերում</h3>
        <p>
            ժամանակակից դա անվտանգ ծրագրավորման լեզու է նա հասանելիություն չունի 
            հիշողությանը կամ համակարգչի պրոցեսրրին քանի որ իսկզբանե ստեղծվել է Բրաուզերի համար 
            և չի պահանջում դա
        </p>
        <p>
            JS - ի հնարավորություները կախված են միջավայրից որտեղ նա աշխատում է
        </p>
        <p>
            Բրաուզերում համար հասանելի է ամեն ինչ ինչը կապ ունի կայքերի հետ, կապի մեջ մտնել օգտագործողի հետ և սերվերի
        </p>
        <p>
            օրինակ
            <ul>
                <li>Ավելացն ել նոր  HTMԼ կոդ էջին, փոխել այն աշխատել style երի հետ</li>
                <li>Արձագանքել օգտագործողի քայլերին օրինակ մկնիկի սեղմանը և այլն</li>
                <li>ուղարկ ել հարցումն եր սերվերին քաշել և ներբեռն ել ֆայլեր (AJAX)</li>
                <li>ստանալ և պահպան ել cookies, հարցեր տալ և այլն</li>
                <li>պհապանել տվյալները («local storage») ում</li>
            </ul>
        </p>
        <h3>Ինչ չի կարող է անել Բրաուզերում</h3>
        <p>
            <ul>
                <li>JavaScript չի կարող կարդալ համակարգչի ինֆորմացինա և այնտեղ ձայնագր ել ինչ որ բան քանի որ այն չունի
                    ուղիղ հասանելիություն համակարգչի պրոցեսրրին
                </li>
                <li>Բռաուզեր տարբեր պատուհանները տեղյակ չեն մեկը մյուսից նույնիսկ այն ժամանկ երբ մի էջից բացել ենք ուրիշ պատուհան եթե դրանք տարբեր կայքերեն</li>
            </ul>
        </p>
    </div>
    
  )
}

export default Introduction