import React from 'react'
import one from "./img/1.jpg"
import two from "./img/2.jpg"
import three from "./img/3.jpg"
import fore from "./img/4.jpg"
import fife from "./img/5.jpg"
import sex from "./img/6.jpg"
function NullMergeOperator() {
    return (
        <div>
            <h1>null միաձուլման օպերատոր (??)</h1>
            <p>null միաձուլման օպերատոր իրենից ներկայացնում է երկու հարցական նշան ?? </p>
            <p>
                քանի որ այն null և undefined հետ աշխատում է նույն ձևով Դրա համար մենք կոգտագործենք հատուկ տերմի
                ավելի կրճատ ասելու համար որ արժեքը սահմանված է եթե այն հավասար չէ null կամ undefined ին
            </p>
            <p>
                a ?? b արտահայտության արդյունքը կլինի հետևյալը
                <ul>
                    <li>եթե a սահմանված է ուրեմն a</li>
                    <li>եթե a սահմանված  չէ ուրեմն b</li>
                </ul>

            </p>
            <p>
                Այլ կերպ ասած ?? օպերատորը վերադարձնում է առաջին արգումենտը եթե այն null/undefined ՉԷ հակառակ դեպքում երկերորդ արգումենտը
            </p>
            <p>
                Null միաձուլման օպերատորը սկզբունքորեն նոր բան չէ: Սա պարզապես հարմար շարահյուսություն է, թե ինչպես կարելի է ստանալ մեկը երկու արժեքներից, որոնք «սահմանված են»:
            </p>
            <p>
                ահա թե ինչպես կարելի է գրել result = a ?? b արտահայտությունը օգտագործելով մեզ արդեն ծանոթ Սինտաքսը
            </p>
            <img src={one} />
            <p>
                ՀԻմա պետքե հասկանալի լինի թե ինչ է անում ?? օպերատորը Հիմա եկեք տեսնենք թե սա որտեղ կարող է մեզ պետք գալ
            </p>
            <p>
                որպես կանոն ?? օպերատորը պետք է այն ժամանակ որպիսի Default տանք արժեք այն փոփոխականին որը վերագրված չէ
            </p>
            <p>
                Օրինակ այստեղ մենք ստեղծում ենք user ը եթե նրա արժեքը null/undefined Չե հակառակ դեպքում Аноним
            </p>
            <img src={two} />
            <p>
                Իսկ այստեղ օրինակ որ  user ը վեագրված է
            </p>
            <img src={three} />
            <p>
                Բացի այդ, դուք կարող եք գրել օպերատորների հաջորդականությունը օգտագործելով ?? օպերատորը որպիսի ստանանք առաջին արժեքը Արտահայտությունից որը հավասար չէ null/undefined
            </p>
            <p>
                Ենթադրենք մենք ունենք ինֆորմացիա Օգտագոծողից որոնք գտնվում են փոփոխականների մեջ firstName, lastName կամ nickName բոլոր այս
                թվարկած փոփոխականները կարողեն լինել չվերագրված եթե Օգտագոծողը նրանք չի լրացրել
            </p>
            <p>
                Մենք կցանկանանք ցույց տալ user ի անունը օգտագործելով այս փոփոխականներից մեկը կամ ցույց տալ «Аноним» եթե նրանք բոլորը null/undefined.
            </p>
            <p>
                դրա համար օգտագործենք ?? օպերատորը
            </p>
            <img src={fore} />
            <h3> || ի հետ համամտությունը </h3>
            <p>
                || ի օպերատորը կարելի օգտագործել այնպես ինչպես ?? օպերատորը
            </p>
            <p>
                Օրինակ եթե վերևում գրված կոդը  ?? օպերատորի փոփոխարն գրենք || ի օպերատորը արդյունքը կլինի նույնը
            </p>
            <img src={fife} />
            <ul>
                այս երկու օպերատորի տարբերությունը կայանում է նրանում որ
                <li>|| ը վերադարձնում է առաջին իրական արժեքը</li>
                <li> ?? ը վերադարձնում է առաջին որոշված արժեքը</li>
            </ul>
            <p>
                Այլ կերպ ասած || օպերատորը չի տարբերում false, 0, դատարկ տողը "" և null/undefined, Նրա համար այս բոլորը նույնեն
                որոնք ներկայացնում են իրենցից կեղծ արժեք
                Եթե առաջին արգումենտը || օպերատորի լինի այս թվարկած արժեքները մենք կստանանք երկրորդ արգումենտը որպես արդյունք
            </p>
            <p>
                Բայց հաճախ մենք օգտագործում ենք default արժեքը այն ժամանակ երբ փոփոխականները  null/undefined են լինում
                հենց այդ պահին է որ արժեքը ՀԱՅՏՆԻ ՉԷ կամ ՀԱՅՏԱՐԱՐՎԱԾ ՉԷ
            </p>
            <img src={sex} />
            <ul>
                <li>
                    height || 100 Ստուգում է height հավասար է կեղժ արժեքի , Նա հավասար է 0 ի որը կեղծ արժեք է
                    <li>այդ իսկ պատչառով արդյունքը երեկրորդ արգումենտն է 100.</li>
                </li>
                <li>
                    height ?? 100 Ստուգում է height պարունակում է null/undefined և քանի որ այն այդպես չէ այսինքն height հավասար է 0 ի
                    <li>այդ իսկ պատճառով արդյունքը կլինի հենց 0 ն</li>
                </li>
            </ul>
            <h3>
                Առաջնահերդությունը
            </h3>
            <p>
                ?? օպերատորի Առաջնահերդությունը հավասար է || օպերատորին նրանք երկուսնել հավասար են 3 ի
            </p>
            <p>
                այսինքն դա նշանակում է որ և || և ?? օպերատորները կկատարվեն ավելի վաղ քան  = և ? բայց կկատարվեն +, * հետո
            </p>
        </div>
    )
}

export default NullMergeOperator