import React from 'react'
import one from "./img/1.jpg"
import two from "./img/2.jpg"
import three from "./img/3.jpg"
import fore from "./img/4.jpg"
import faife from "./img/5.jpg"
import sex from "./img/6.jpg"
import seven from "./img/7.jpg"

function CodeStructure() {
  return (
    <div>
        <h1>Կոդի կառուցվածքը</h1>
        <p>Սկսենք սովորել լեզուն ուսումնասիրելով կոդի կառուցող բլօկներից</p>
        <h3>Հրահանգներ</h3>
        <p>
        Հրահանգները - դա սինտաքսային կոնստրուկցիաներ են և հրամաներ, որոնք կատարում են գործողություն
        օրիանկ  alert('Привет, мир!') որը ցույց է տալիս նամակ Привет, мир!
        </p>
        <p>
            մեր կոդում կարողենք գրել ցանկացած քանակի հրամաներ
            հրամաներ կարողեն իրարից բաժանվել կետ ստորակետով
        </p>
        <p>
            օրինակ այստեղ Привет Мир նամակը մենք բաժանել ենք երկու տարբեր alert հրամաների միջև
        </p>
        <img src={one} />
        <p>
            Սովորաբար ցանակացած նոր հրաման գրվում է նոր տողից
        </p>
        <img src={two} />
        <h3>Կետ Ստրակետ</h3>
        <p>
            Մեծամասամբ կետ ստորակետները կարելի է չդնել 
            եթե կա տողադարձ նոր տող 
            այսպես նույնպես կաշխատի
        </p>
        <img src={three} />
        <p>
            այս դեպքում JavaScript մեկնաբանում է կոդի տողադարձը որպես անուղղակի կետ ստորակետ
            սա կոչվում է ավտոմատ կետ ստորակետի տեղադրում
        </p>
        <p>
            մեծամասամբ նոր տողը ենթադրում է կետ ստորակետ բայց մեծամասամբ չի նշանակում միշտ 
        </p>
        <p>
            օրինակ որոշ դեպքերում նոր տողը չի նշանակում որ պետքե դրվի կետ ստորակետով 
        </p>
        <img src={fore} />
        <p>
            այս նկարում կոդը կվերադարձնի 6 , քանի որ JavaScriptը այստեղ  չի դնում կետ ստորակետ
            այստեղ նկատելի է որ եթե  տողը վերջանում է "+" նշանով ուրեմ այդ տողը չավարտված արտահայտություն է 
        </p>
        <p>
            բայց կան դեպքեր որ JavaScript մոռանում է դնել կետ ստորակետ այնտեղ որտեղ հարկավոր է 
        </p>
        <p>
            այս նկարում կոդը կկատարվի հետևյալ հերդականությամբ
            1․ Hello 
            2. 1 
            3. 2
        </p>
        <img src={faife} />
        <p>
            իսկ հիմա կետ ստորակետը ջնջենք  alert ից հետո
        </p>
        <img src={sex} />
        <p>
            այս կոդը տարբերվում է վերևի կոդից նրանով որ առաջին տողի կետ ստորակետը ջնջել ենք 
            եթե մենք աշխատացնենք այս կոդը կաշխատի միայն առաջին  alert իսկ հետո մենք կստատնք սխալ 
            Քանի որ  JavaScript չի դնում կետ ստորակետ [] այս փակագծերից առաջ 
            և կոդը աշխատում է որպես մեկ հրաման 
        </p>
        <p>
            ահա այսպես է տեսնում JavaScriptը նման կոդը 
        </p>
        <img src={seven} />
        <p>
            մենք պարտավորենք alert ից հետ դնել կետ ստորակետ
        </p>
    </div>
  )
}

export default CodeStructure